#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_key_pair.my_key: Refreshing state... [id=my_key]
data.aws_ami.rhel: Reading...
aws_vpc.php_vpc: Refreshing state... [id=vpc-087d2d84c444f7ff2]
data.aws_ami.rhel: Read complete after 0s [id=ami-09d5ee2fe22f85a55]
aws_subnet.php_subnet: Refreshing state... [id=subnet-0fe5d0e2c1c4ab9fb]
aws_internet_gateway.php_igw: Refreshing state... [id=igw-041c5f977f9e52df0]
aws_security_group.php_security_group: Refreshing state... [id=sg-01c3b270079bcb680]
aws_route_table.php_pub_igw: Refreshing state... [id=rtb-0d9c2f96c3bc32bfb]
aws_security_group_rule.egress_access: Refreshing state... [id=sgrule-2122104821]
aws_security_group_rule.http_ingress_access: Refreshing state... [id=sgrule-2692215368]
aws_instance.php_instance: Refreshing state... [id=i-083874ba260d33d57]
aws_route_table_association.php_rt_subnet_public: Refreshing state... [id=rtbassoc-0847dc441f19cfc62]
ansible_host.php_instance: Refreshing state... [id=ec2-18-222-76-217.us-east-2.compute.amazonaws.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # ansible_host.php_instance will be updated in-place
  ~ resource "ansible_host" "php_instance" {
        id        = "ec2-18-222-76-217.us-east-2.compute.amazonaws.com"
      ~ name      = "ec2-18-222-76-217.us-east-2.compute.amazonaws.com" -> "ec2-3-141-3-59.us-east-2.compute.amazonaws.com"
        # (2 unchanged attributes hidden)
    }

  # aws_security_group_rule.ssh_ingress_access will be created
  + resource "aws_security_group_rule" "ssh_ingress_access" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "ssh"
      + security_group_id        = "sg-01c3b270079bcb680"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ public_ip = "3.147.83.146" -> "3.141.3.59"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @r3dact3d, Action: `pull_request`*